###############################################################################
# Created by write_sdc
###############################################################################
current_design top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clkA -period 20.0000 [get_ports {clkA}]
create_clock -name spi_sclk -period 100.0000 [get_ports {spi_sclk}]
set_clock_groups -name group1 -asynchronous \
 -group [get_clocks {clkA}]\
 -group [get_clocks {spi_sclk}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
